# read_sources
read_verilog llsdspi.v
read_verilog sdspi_bug_c3.v

hierarchy -top sdspi

# minimal btor
proc -noopt

# extra
opt

async2sync
flatten
dffunmap


write_btor -x sdspi_c3.btor
