# read_sources
read_verilog axis_fifo.v

hierarchy -top axis_fifo

# minimal btor
proc -noopt

# extra
opt

async2sync
flatten
dffunmap


write_btor -x axis_fifo.btor
