# read_sources
read_verilog mux_4_1.v

hierarchy -top mux_4to1_case

# minimal btor
proc -noopt

# extra
opt

async2sync
flatten
dffunmap


write_btor -x mux_4_1.btor
